Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/InformationRegisters/гкс_ТекущиеФМОР/гкс_ТекущиеФМОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>гкс_ТекущиеФМОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ТМФМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ТМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ФМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка И Не гкс_ТекущиеФМОР.ТМ.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		ТекущийОбъектТехническоеМесто = Выборка.ТМ.ПолучитьОбъект();
		ТекущийОбъектТехническоеМесто.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		гкс_ОбщегоНазначенияСервер.ОбновитьКодировкиОР(Ссылка);;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ)

	Если НЕ ЭтоНовый() Тогда
		Если ПодразделениеИсполнитель <> Ссылка.ПодразделениеИсполнитель Тогда
			ДополнительныеСвойства.Вставить("НеобходимаРегистрацияЗаявокДляМобильныхБригад", Истина);
		КонецЕсли;
	Иначе
		Если ДополнительныеСвойства.Свойство("ТекСтруктураИерархии") И ДополнительныеСвойства.Свойство("РодительИерархии") Тогда
			СсылкаНаОбъект = торо_ОбщегоНазначения.ПолучитьСсылкуНаОбъект(ЭтотОбъект);

			Попытка
				торо_РаботаСИерархией20.ВключитьНовыйОбъектРемонтаВИерархию(СсылкаНаОбъект, ДополнительныеСвойства.ТекСтруктураИерархии, ДополнительныеСвойства.РодительИерархии, Отказ, ОбменДанными.Загрузка);
			Исключение
				#Удаление
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исключение'"), УровеньЖурналаРегистрации.Предупреждение, 
				#КонецУдаления
				#Вставка
				ЗаписьЖурналаРегистрации(НСтр("es='La excepción';ru='Исключение';en='An exception'"), УровеньЖурналаРегистрации.Предупреждение, 
				#КонецВставки
				Метаданные.Справочники.торо_ОбъектыРемонта,,ОписаниеОшибки());
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	#Вставка
	Если ЭтоГруппа = Ложь Тогда 
		Если ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
			Направление = Неопределено;
			ЭтоАктив = Ложь;
			ВнешнийОбъект = Ложь;
			ИнвентарныйНомер = "";
			СрокПолезногоИспользования = 0;
			Если ЗначениеЗаполнено(ДатаВводаВЭксплуатацию) И (ЗначениеЗаполнено(ДатаВыпуска) = Ложь ИЛИ ДатаВводаВЭксплуатацию < ДатаВыпуска) Тогда 
				ДатаВыпуска = ДатаВводаВЭксплуатацию - 1;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ТипОбъекта) = Ложь Тогда 
			ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.Ссылка = &Ссылка
			|	И НЕ торо_ОбъектыРемонта.ТиповойОР = &ТиповойОР";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ТиповойОР", ТиповойОР);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
				РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор.Объект.Установить(Ссылка);
			НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Добавить();
			НоваяСтрокаНабораЗаписей.Объект = Ссылка;
			НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Гкс+[TOIR20-582] Зозуля А.В. от 27.05.2025. Добавлено:{
	Если Не ОбменДанными.Загрузка Тогда
		Если Не ЗначениеЗаполнено(Подразделение) И 
			(ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект Или ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено подразделение'"),, "Объект.Подразделение");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПодразделениеИсполнитель) И ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено подразделение-исполнитель'"),, "Объект.ПодразделениеИсполнитель");
		КонецЕсли;
	КонецЕсли;
	// } Гкс-[TOIR20-582] Зозуля А.В. от 27.05.2025.
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ПриКопировании")
Процедура Расш_гкс_ПриКопировании(ОбъектКопирования)

	#Вставка
	Если ЭтоГруппа = ложь Тогда 
		// Гкс+[TOIR20-131] Селимов от 14.07.2020. Добавлено:{
		Если Не Родитель.ЭтоГруппа Тогда
			Родитель = Неопределено;			
		КонецЕсли; // } Гкс-[TOIR20-131] 
	#КонецВставки
	УдалитьНаборСвойств = Неопределено;
	НеУчаствуетВПланировании = Ложь;
	#Вставка
	КонецЕсли;
	#КонецВставки

КонецПроцедуры

#КонецОбласти
